/** ***************************************************************************
 * @File Name: ebtn_custom_callback.c
 * @brief 自定义按键状态检测和事件处理函数
 * @credit : bobwenstudy / easy_button https://github.com/bobwenstudy/easy_button
 * @Author : Sighthesia / easy_button-Application https://github.com/Sighthesia/easy_button-Application/tree/main
 * @Version : 1.0.0
 * @Creat Date : 2025-05-16
 * ----------------------------------------------------------------------------
 * @Modification
 * @Author : Sighthesia
 * @Changes :
 * @Modifi Date :
 */
#include "ebtn_custom_callback.h"

/* ---------------------------- 此函数中可自定义按键状态检测方式 ---------------------------- */

/** ***************************************************************************
 * @brief  获取按键状态回调函数
 * 此函数默认采用了查表检测，免去需要手动为每个按键添加检测方式
 * 也可为特殊按键自定义检测方法
 * @note   查表检测需要配合ebtn_custom_config.c中的按键配置结构体数组使用
 * @param  btn: easy_button按键结构体指针
 * @return 按键状态，0表示未按下，1表示按下
 */
uint8_t ebtn_Get_State(struct ebtn_btn *btn)
{
    // 查表法检测
    for (int i = 0; i < key_list_size; i++)
    {
        if (key_list[i].key_id == btn->key_id)
        {
            uint8_t pin_state = ebtn_custom_hal.Read_Pin(key_list[i].gpio_port, key_list[i].gpio_pin);
            // 根据有效电平转换
            if (key_list[i].active_level == pin_state)
            {
                pin_state = 1;
            }
            else
            {
                pin_state = 0;
            }
            return pin_state;
        }
    }

    /* ----------------------------- 此处可自定义按键状态获取方式 ----------------------------- */
    // 可自定义特殊按键的检测方式，如矩阵按键的检测

    return 0; // 未找到按键ID，返回0
}

/* ------------------------------- 此函数可修改按键触发事件 ------------------------------- */

/** ***************************************************************************
 * @brief  按键事件处理回调函数，在此定义按键触发事件
 * 推荐将不同按键或事件的处理逻辑拆分为独立的函数，并参考原有的 switch(ebtn->key) 结构，
 * 在对应按键编号的 case 分支中调用相应的处理函数，以提升代码的可读性和可维护性
 * @param  btn: easy_button按键结构体指针
 * @param  evt: 事件类型
 */
void ebtn_Event_Handler(struct ebtn_btn *btn, ebtn_evt_t evt)
{
    switch (btn->key_id) // 按键ID
    {
    /* ---------------------------------- KEY1 ---------------------------------- */
    case KEY_1:
        /* ---------------------------------- 按下按键时 --------------------------------- */
        if (evt == EBTN_EVT_ONPRESS)
        {
        }
        /* ---------------------------------- 松开按键时 --------------------------------- */
        else if (evt == EBTN_EVT_ONRELEASE)
        {
        }
        /* ----------------------------- 短按按键时（可获取连击次数） ----------------------------- */
        else if (evt == EBTN_EVT_ONCLICK)
        {
            /* ----------------------------------- 单击时 ---------------------------------- */
            if (btn->click_cnt == 1)
            {
            }
            /* ----------------------------------- 双击时 ---------------------------------- */
            else if (btn->click_cnt == 2)
            {
            }
            /* ----------------------------------- 三击时 ---------------------------------- */
            else if (btn->click_cnt == 3)
            {
            }
        }
        /* ------------------------- 长按达到最短时间（配置默认600ms），触发长按计数时 ------------------------ */
        else if (evt == EBTN_EVT_KEEPALIVE)
        {
            /* ------------------------------- 长按计数到达指定值时 ------------------------------- */
            if (btn->keepalive_cnt == 1)
            {
            }
        }
        break;
        /* ----------------------------------- KEY2 ---------------------------------- */
    case KEY_2:
        /* ---------------------------------- 按下按键时 --------------------------------- */
        if (evt == EBTN_EVT_ONPRESS)
        {
        }
        /* ---------------------------------- 松开按键时 --------------------------------- */
        else if (evt == EBTN_EVT_ONRELEASE)
        {
        }
        /* ----------------------------- 短按按键时（可获取连击次数） ----------------------------- */
        else if (evt == EBTN_EVT_ONCLICK)
        {
            /* ----------------------------------- 单击时 ---------------------------------- */
            if (btn->click_cnt == 1)
            {
            }
            /* ----------------------------------- 双击时 ---------------------------------- */
            else if (btn->click_cnt == 2)
            {
            }
        }
        /* ----------------------------------- 三击时 ---------------------------------- */
        else if (btn->click_cnt == 3)
        {
        }
        /* ------------------------- 长按到达最最短时间（默认600ms），触发长按计数时 ------------------------ */
        else if (evt == EBTN_EVT_KEEPALIVE)
        {
            /* ------------------------------- 长按计数到达指定值时 ------------------------------- */
            if (btn->keepalive_cnt == 3)
            {
            }
        }
        break;

        /* ----------------------------------- 组合键1 ---------------------------------- */

    case COMBO_KEY_1:
        /* ---------------------------------- 按下按键时 --------------------------------- */
        if (evt == EBTN_EVT_ONPRESS)
        {
        }
        /* ---------------------------------- 松开按键时 --------------------------------- */
        else if (evt == EBTN_EVT_ONRELEASE)
        {
        }
        break;

        /* ---------------------------------- 组合键2 ---------------------------------- */

    case COMBO_KEY_2:
        /* ---------------------------------- 按下按键时 --------------------------------- */
        if (evt == EBTN_EVT_ONPRESS)
        {
        }
        /* ---------------------------------- 松开按键时 --------------------------------- */
        else if (evt == EBTN_EVT_ONRELEASE)
        {
        }
        break;

        /* ---------------------------------- 组合键3 ---------------------------------- */

    case COMBO_KEY_3:
        /* ---------------------------------- 按下按键时 --------------------------------- */
        if (evt == EBTN_EVT_ONPRESS)
        {
        }
        /* ---------------------------------- 松开按键时 --------------------------------- */
        else if (evt == EBTN_EVT_ONRELEASE)
        {
        }
        break;

        /* ---------------------------------- 组合键4 ---------------------------------- */

    case COMBO_KEY_4:
        /* ---------------------------------- 按下按键时 --------------------------------- */
        if (evt == EBTN_EVT_ONPRESS)
        {
        }
        /* ---------------------------------- 松开按键时 --------------------------------- */
        else if (evt == EBTN_EVT_ONRELEASE)
        {
        }
        break;
    }
}